tap "homebrew/bundle"
tap "homebrew/services"
tap "sidneys/homebrew"
tap "zegervdv/zathura"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Nice terminal
brew "iterm2"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Download with resuming and segmented downloading
brew "aria2"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# Extract files from Microsoft cabinet files
brew "cabextract"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Message bus system, providing inter-application communication
brew "dbus"
# Functional programming language for building browser-based GUIs
brew "elm"
# Platform built on V8 to build network applications
brew "node"
# Extremely fast JavaScript bundler and minifier
brew "esbuild"
# Program that can automate interactive applications
brew "expect"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Cross-platform library for audio I/O
brew "portaudio"
# Real-time software synthesizer based on the SoundFont 2 specs
brew "fluid-synth"
# Formatter for Haskell source code
brew "fourmolu"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# Glorious Glasgow Haskell Compilation System
brew "ghc@8.10"
# Installer for the general purpose language Haskell
brew "ghcup"
# Interpreter for PostScript and PDF
brew "ghostscript"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# GUI toolkit
brew "gtk+"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Integration point for ghcide and haskell-ide-engine. One IDE to rule them all
brew "haskell-language-server"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Library for parsing ini files
brew "iniparser"
# Interactive computing in Python
brew "ipython"
# Utility to optimize JPEG files
brew "jpegoptim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab"
# Library that sends desktop notifications to a notification daemon
brew "libnotify"
# LSP for LanguageTool with support for Latex, Markdown and Others
brew "ltex-ls"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Cross platform, open source .NET development framework
brew "mono"
# Text-based UI library
brew "ncurses"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@16"
# Development kit for the Java programming language
brew "openjdk@11"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf", link: false
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit", link: false
# Sound system for POSIX OSes
brew "pulseaudio"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# PureScript package manager and build tool
brew "spago"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Free software distribution for the TeX typesetting system
brew "texlive", link: false
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Offline NT Password Editor
brew "sidneys/homebrew/chntpw"
# Interface library
brew "zegervdv/zathura/girara", args: ["HEAD"]
# PDF viewer
brew "zegervdv/zathura/zathura", args: ["HEAD"]
# Poppler backend plugin for zathura
brew "zegervdv/zathura/zathura-pdf-poppler"
# Nice ls replacement
brew "eza"
# Enable Windows-like alt-tab
cask "alt-tab"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# PDF file editor
cask "combine-pdfs"
# LaTeX handwritten symbol recognition
cask "detexify"
# Developer platform
cask "dotnet-sdk"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# PDF reader and note-taking application
cask "skim"
# UNIX shell (command interpreter)
brew "zsh"
