tap "homebrew/bundle"
tap "sigstore/tap"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# Elm source code formatter, inspired by gofmt
brew "elm-format"
# Command-line fuzzy finder written in Go
brew "fzf"
# Installer for the general purpose language Haskell
brew "ghcup"
# Integration point for ghcide and haskell-ide-engine. One IDE to rule them all
brew "haskell-language-server"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Language Server for the Lua language
brew "lua-language-server"
# Text-based UI library
brew "ncurses"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Implementation of the Language Server Protocol for LaTeX
brew "texlab"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Keyless Git signing using Sigstore
brew "sigstore/tap/gitsign"
# Desktop client for the chat platform Cabal
cask "cabal"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
